index=* sourcetype="WinEventLog:Security" EventCode=4688
 | search (Process_Command_Line="\w+`(\w+|-|.)`[\w+|\s]" OR Process_Command_Line=""(\{\d\})+"\s*-f" OR Process_Command_Line="(?i)\$\{`?e`?n`?v`?:`?p`?a`?t`?h`?\}") OR (Process_Command_Line="*${env:path}*")
| table _time, New_Process_Name, Process_Command_Line