index=* sourcetype="WinEventLog:Security" EventCode=4688
 | search (New_Process_Name="*\wbadmin.exe" OR Original_File_Name="WBADMIN.EXE") | search ((Process_Command_Line="delete" OR Process_Command_Line="backup") AND Process_Command_Line="*keepVersions:0*")
| table _time, New_Process_Name, Process_Command_Line