index=* sourcetype="WinEventLog:Security" EventCode=4688
 | search ((Process_Command_Line="\SyncAppvPublishingServer.vbs" OR Process_Command_Line=";"))
| table _time, New_Process_Name, Process_Command_Line