index=* sourcetype="WinEventLog:Security" EventCode=4688
 | search (New_Process_Name="*\dnscmd.exe" AND (Process_Command_Line="/config" OR Process_Command_Line="/serverlevelplugindll"))
| table _time, New_Process_Name, Process_Command_Line