index=* sourcetype="WinEventLog:Security" EventCode=4688
 | search (New_Process_Name="*\tpmvscmgr.exe" AND Original_File_Name="TpmVscMgr.exe") | search (Process_Command_Line="*create*")
| table _time, New_Process_Name, Process_Command_Line