index=* sourcetype="WinEventLog:Security" EventCode=4688
 | search (New_Process_Name="*\conhost.exe" AND (Parent_Process_Name="*\explorer.exe" OR Parent_Process_Name="*\lsass.exe" OR Parent_Process_Name="*\regsvr32.exe" OR Parent_Process_Name="*\rundll32.exe" OR Parent_Process_Name="*\services.exe" OR Parent_Process_Name="*\smss.exe" OR Parent_Process_Name="*\spoolsv.exe" OR Parent_Process_Name="*\svchost.exe" OR Parent_Process_Name="*\userinit.exe" OR Parent_Process_Name="*\wininit.exe" OR Parent_Process_Name="*\winlogon.exe")) OR ((Parent_Process_Command_Line="*-k apphost -s AppHostSvc*" OR Parent_Process_Command_Line="*-k imgsvc*" OR Parent_Process_Command_Line="*-k localService -p -s RemoteRegistry*" OR Parent_Process_Command_Line="*-k LocalSystemNetworkRestricted -p -s NgcSvc*" OR Parent_Process_Command_Line="*-k NetSvcs -p -s NcaSvc*" OR Parent_Process_Command_Line="*-k netsvcs -p -s NetSetupSvc*" OR Parent_Process_Command_Line="*-k netsvcs -p -s wlidsvc*" OR Parent_Process_Command_Line="*-k NetworkService -p -s DoSvc*" OR Parent_Process_Command_Line="*-k wsappx -p -s AppXSvc*" OR Parent_Process_Command_Line="*-k wsappx -p -s ClipSVC*" OR Parent_Process_Command_Line="*-k wusvcs -p -s WaaSMedicSvc*")) OR ((Parent_Process_Command_Line="*C:\Program Files (x86)\Dropbox\Client\*" OR Parent_Process_Command_Line="*C:\Program Files\Dropbox\Client\*"))
| table _time, New_Process_Name, Process_Command_Line