index=* sourcetype="WinEventLog:Security" EventCode=4688
 | search ((New_Process_Name="*\whoami.exe" OR New_Process_Name="*\quser.exe" OR New_Process_Name="*\qwinsta.exe")) OR (New_Process_Name="*\wmic.exe" AND (Process_Command_Line="useraccount" OR Process_Command_Line="get")) OR (New_Process_Name="*\cmdkey.exe" AND Process_Command_Line="* /l*") OR (New_Process_Name="*\cmd.exe" AND (Process_Command_Line=" /c" OR Process_Command_Line="dir " OR Process_Command_Line="\Users\")) OR (Process_Command_Line="* rmdir *") OR ((New_Process_Name="*\net.exe" OR New_Process_Name="*\net1.exe") AND Process_Command_Line="*user*") OR ((Process_Command_Line="*/domain*" OR Process_Command_Line="*/add*" OR Process_Command_Line="*/delete*" OR Process_Command_Line="*/active*" OR Process_Command_Line="*/expires*" OR Process_Command_Line="*/passwordreq*" OR Process_Command_Line="*/scriptpath*" OR Process_Command_Line="*/times*" OR Process_Command_Line="*/workstations*"))
| table _time, New_Process_Name, Process_Command_Line