index=* sourcetype="WinEventLog:Security" EventCode=4688
 | search (New_Process_Name="*['\\net.exe', '\\net1.exe']" OR Original_File_Name="['net.exe', 'net1.exe']") | search (Process_Command_Line="* user *") | search ((Process_Command_Line="* Järjestelmänvalvoja *" OR Process_Command_Line="* Rendszergazda *" OR Process_Command_Line="* Администратор *" OR Process_Command_Line="* Administrateur *" OR Process_Command_Line="* Administrador *" OR Process_Command_Line="* Administratör *" OR Process_Command_Line="* Administrator *" OR Process_Command_Line="* guest *" OR Process_Command_Line="* DefaultAccount *" OR Process_Command_Line="* "Järjestelmänvalvoja" *" OR Process_Command_Line="* "Rendszergazda" *" OR Process_Command_Line="* "Администратор" *" OR Process_Command_Line="* "Administrateur" *" OR Process_Command_Line="* "Administrador" *" OR Process_Command_Line="* "Administratör" *" OR Process_Command_Line="* "Administrator" *" OR Process_Command_Line="* "guest" *" OR Process_Command_Line="* "DefaultAccount" *" OR Process_Command_Line="* 'Järjestelmänvalvoja' *" OR Process_Command_Line="* 'Rendszergazda' *" OR Process_Command_Line="* 'Администратор' *" OR Process_Command_Line="* 'Administrateur' *" OR Process_Command_Line="* 'Administrador' *" OR Process_Command_Line="* 'Administratör' *" OR Process_Command_Line="* 'Administrator' *" OR Process_Command_Line="* 'guest' *" OR Process_Command_Line="* 'DefaultAccount' *")) | search ((Process_Command_Line="guest" OR Process_Command_Line="/active no"))
| table _time, New_Process_Name, Process_Command_Line