index=* sourcetype="WinEventLog:Security" EventCode=4688
 | search ((New_Process_Name="*\powershell.exe" OR New_Process_Name="*\pwsh.exe") AND (Process_Command_Line="Add-PSSnapin" OR Process_Command_Line="Get-Recipient" OR Process_Command_Line="-ExpandProperty" OR Process_Command_Line="EmailAddresses" OR Process_Command_Line="SmtpAddress" OR Process_Command_Line="-hidetableheaders"))
| table _time, New_Process_Name, Process_Command_Line