index=* sourcetype="WinEventLog:Security" EventCode=4688
 | search (New_Process_Name=":\Program Files*" AND New_Process_Name="*\Microsoft Visual Studio\*" AND New_Process_Name="*\dump64.exe") OR (Original_File_Name="procdump" OR Process_Command_Line="*[' -ma ', ' -mp ']*")
| table _time, New_Process_Name, Process_Command_Line