index=* sourcetype="WinEventLog:Security" EventCode=4688
 | search ((Process_Command_Line="*\Software\Aerofox\Foxmail\V3.1*" OR Process_Command_Line="*\Software\Aerofox\FoxmailPreview*" OR Process_Command_Line="*\Software\DownloadManager\Passwords*" OR Process_Command_Line="*\Software\FTPWare\COREFTP\Sites*" OR Process_Command_Line="*\Software\IncrediMail\Identities*" OR Process_Command_Line="*\Software\Martin Prikryl\WinSCP 2\Sessions*" OR Process_Command_Line="*\Software\Mobatek\MobaXterm\*" OR Process_Command_Line="*\Software\OpenSSH\Agent\Keys*" OR Process_Command_Line="*\Software\OpenVPN-GUI\configs*" OR Process_Command_Line="*\Software\ORL\WinVNC3\Password*" OR Process_Command_Line="*\Software\Qualcomm\Eudora\CommandLine*" OR Process_Command_Line="*\Software\RealVNC\WinVNC4*" OR Process_Command_Line="*\Software\RimArts\B2\Settings*" OR Process_Command_Line="*\Software\SimonTatham\PuTTY\Sessions*" OR Process_Command_Line="*\Software\SimonTatham\PuTTY\SshHostKeys\*" OR Process_Command_Line="*\Software\Sota\FFFTP*" OR Process_Command_Line="*\Software\TightVNC\Server*" OR Process_Command_Line="*\Software\WOW6432Node\Radmin\v3.0\Server\Parameters\Radmin*")) OR (New_Process_Name="*reg.exe" AND (Process_Command_Line="*export*" OR Process_Command_Line="*save*"))
| table _time, New_Process_Name, Process_Command_Line