index=* sourcetype="WinEventLog:Security" EventCode=4688
 | search (New_Process_Name="*['\\cmd.exe', '\\powershell.exe', '\\pwsh.exe']" OR Original_File_Name="['Cmd.Exe', 'PowerShell.EXE', 'pwsh.dll']") | search ((Parent_Process_Name="\Windows\Installer\" OR Parent_Process_Name="msi") AND Parent_Process_Name="*tmp")
| table _time, New_Process_Name, Process_Command_Line