index=* sourcetype="WinEventLog:Security" EventCode=4688
 | search (New_Process_Name="*\cmd.exe" OR Original_File_Name="Cmd.Exe") | search ((Process_Command_Line="assoc " OR Process_Command_Line="exefile")) | search (Process_Command_Line="*.exe=exefile*")
| table _time, New_Process_Name, Process_Command_Line