index=* sourcetype="WinEventLog:Security" EventCode=4688
 | search (New_Process_Name="*\KrbRelay.exe" OR Original_File_Name="KrbRelay.exe") OR ((Process_Command_Line=" -spn " OR Process_Command_Line=" -clsid " OR Process_Command_Line=" -rbcd ")) OR ((Process_Command_Line="shadowcred" OR Process_Command_Line="clsid" OR Process_Command_Line="spn")) OR ((Process_Command_Line="spn " OR Process_Command_Line="session " OR Process_Command_Line="clsid "))
| table _time, New_Process_Name, Process_Command_Line