index=* sourcetype="WinEventLog:Security" EventCode=4688
 | search ((Parent_Process_Name="*\w3wp.exe" OR Parent_Process_Name="*\php-cgi.exe" OR Parent_Process_Name="*\nginx.exe" OR Parent_Process_Name="*\httpd.exe" OR Parent_Process_Name="*\caddy.exe" OR Parent_Process_Name="*\ws_tomcatservice.exe")) OR ((Parent_Process_Name="*\java.exe" OR Parent_Process_Name="*\javaw.exe") AND (Parent_Process_Name="*-tomcat-*" OR Parent_Process_Name="*\tomcat*")) OR ((Parent_Process_Name="*\java.exe" OR Parent_Process_Name="*\javaw.exe") AND (Process_Command_Line="*catalina.jar*" OR Process_Command_Line="*CATALINA_HOME*")) OR ((Original_File_Name="net.exe" OR Original_File_Name="net1.exe") AND (Process_Command_Line="* user *" OR Process_Command_Line="* use *" OR Process_Command_Line="* group *")) OR (Original_File_Name="ping.exe" AND Process_Command_Line="* -n *") OR ((Process_Command_Line="*&cd&echo*" OR Process_Command_Line="*cd /d *")) OR (Original_File_Name="wmic.exe" AND Process_Command_Line="* /node:*") OR ((New_Process_Name="*\cmd.exe" OR New_Process_Name="*\powershell.exe" OR New_Process_Name="*\pwsh.exe") AND (Process_Command_Line="* -enc *" OR Process_Command_Line="* -EncodedCommand *" OR Process_Command_Line="* -w hidden *" OR Process_Command_Line="* -windowstyle hidden*" OR Process_Command_Line="*.WebClient).Download*")) OR (New_Process_Name="*['\\dsquery.exe', '\\find.exe', '\\findstr.exe', '\\ipconfig.exe', '\\netstat.exe', '\\nslookup.exe', '\\pathping.exe', '\\quser.exe', '\\schtasks.exe', '\\systeminfo.exe', '\\tasklist.exe', '\\tracert.exe', '\\ver.exe', '\\wevtutil.exe', '\\whoami.exe']" OR Original_File_Name="['dsquery.exe', 'find.exe', 'findstr.exe', 'ipconfig.exe', 'netstat.exe', 'nslookup.exe', 'pathping.exe', 'quser.exe', 'schtasks.exe', 'sysinfo.exe', 'tasklist.exe', 'tracert.exe', 'ver.exe', 'VSSADMIN.EXE', 'wevtutil.exe', 'whoami.exe']") OR ((Process_Command_Line="* Test-NetConnection *" OR Process_Command_Line="*dir \*"))
| table _time, New_Process_Name, Process_Command_Line