index=* sourcetype="WinEventLog:Security" EventCode=4688
 | search (Process_Command_Line="cmd.{0,5}(?:/c|/r).+powershell.+(?:\$\{?input\}?|noexit).+\"")
| table _time, New_Process_Name, Process_Command_Line