index=* sourcetype="WinEventLog:Security" EventCode=4688
 | search (New_Process_Name="*\bitsadmin.exe" OR Original_File_Name="bitsadmin.exe") | search (Process_Command_Line="*/SetNotifyCmdLine*") | search ((Process_Command_Line="*%COMSPEC%*" OR Process_Command_Line="*cmd.exe*" OR Process_Command_Line="*regsvr32.exe*")) | search (Process_Command_Line="*/Addfile*") | search ((Process_Command_Line="*http:*" OR Process_Command_Line="*https:*" OR Process_Command_Line="*ftp:*" OR Process_Command_Line="*ftps:*"))
| table _time, New_Process_Name, Process_Command_Line