index=* sourcetype="WinEventLog:Security" EventCode=4688
 | search ((Parent_Process_Name="*\explorer.exe" OR Parent_Process_Name="*\dopus.exe")) | search (New_Process_Name="*['\\EXCEL.EXE', '\\POWERPNT.EXE', '\\WINWORD.exe']" OR Original_File_Name="['Excel.exe', 'POWERPNT.EXE', 'WinWord.exe']") | search ((Process_Command_Line="*\AppData\Roaming\Microsoft\Templates*" OR Process_Command_Line="*\AppData\Roaming\Microsoft\Word\Startup\*" OR Process_Command_Line="*\Microsoft Office\root\Templates\*" OR Process_Command_Line="*\Microsoft Office\Templates\*")) | search ((Process_Command_Line="*.dotx" OR Process_Command_Line="*.xltx" OR Process_Command_Line="*.potx"))
| table _time, New_Process_Name, Process_Command_Line