index=* sourcetype="WinEventLog:Security" EventCode=4688
 | search (Process_Command_Line="(?i)(set).*&&\s?set.*(environment|invoke|\$\{?input).*&&.*"")
| table _time, New_Process_Name, Process_Command_Line