index=* sourcetype="WinEventLog:Security" EventCode=4688
 | search (Original_File_Name="HH.exe" OR New_Process_Name="*\hh.exe") | search ((Process_Command_Line="*.application*" OR Process_Command_Line="*\AppData\Local\Temp\*" OR Process_Command_Line="*\Content.Outlook\*" OR Process_Command_Line="*\Downloads\*" OR Process_Command_Line="*\Users\Public\*" OR Process_Command_Line="*\Windows\Temp\*"))
| table _time, New_Process_Name, Process_Command_Line