index=* sourcetype="WinEventLog:Security" EventCode=4688
| search Process_Command_Line IN ("*\\ping.exe 0x*", "*\\ping 0x*") | search New_Process_Name="*ping.exe*"
| table _time, New_Process_Name, Process_Command_Line