index=* sourcetype="WinEventLog:Security" EventCode=4688
| search Process_Command_Line IN ("*\\CurrentVersion\\Image File* Execution Options\\sethc.exe*", "OR", "*\\CurrentVersion\\Image File* Execution Options\\utilman.exe*", "OR", "*\\CurrentVersion\\Image File* Execution Options\\osk.exe*", "OR", "*\\CurrentVersion\\Image File* Execution Options\\magnify.exe*", "OR", "*\\CurrentVersion\\Image File* Execution Options\\narrator.exe*", "OR", "*\\CurrentVersion\\Image File* Execution Options\\displayswitch.exe*", "OR", "*\\CurrentVersion\\Image File* Execution Options\\atbroker.exe*")
| table _time, New_Process_Name, Process_Command_Line